OpenFOAM-v2106/tutorials/heatTransfer/chtMultiRegionFoam/externalSolarLoad/0.orig/solid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    solid_to_domain3
    {
        type            calculated;
        value           uniform 0;
    }

    solid_to_air
    {
        type            calculated;
        value           uniform 0;
    }

    solid_to_floor
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
